app/Controllers/GalleryController.php

    public function index()
    {
        $model = new GalleryModel();

        // Set the number of items per page
        $perPage = 4;

        // Get the current page from the URL, default to 1 if not set
        $page = $this->request->getVar('page') ?? 1;

        // Get the total count of gallery items
        $totalItems = $model->countAllResults();

        // Get paginated data
        $data = $model->paginate($perPage, 'default', $page);
---
SELECT *
FROM `gallery`