app/Controllers/Home.php

    public function index(): string
    {
        $model = new WisataModel();
        $data['wisata'] = $model->findAll();
---
SELECT *
FROM `wisata`