app/Controllers/WisataController.php

SELECT *
FROM `wisata`
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `wisata`
---
    public function index2()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $model = new WisataModel();
        $perPage = 10; // Number of items per page

        $data['wisata'] = $model->paginate($perPage);