app/Models/VisitorModel.php

SELECT *
FROM `visitors`
WHERE `visit_date` = '2024-08-29'
AND `ip_address` = '::1'
 LIMIT 1
---
    public function incrementDailyVisits($ipAddress)
    {
        $today = date('Y-m-d');
        $existingRecord = $this->where('visit_date', $today)
                               ->where('ip_address', $ipAddress)
                               ->first();

SELECT SUM(`visit_count`) AS `visit_count`
FROM `visitors`
---
    public function getTotalVisits()
    {
        $result = $this->selectSum('visit_count')->get()->getRow();

SELECT SUM(`visit_count`) AS `visit_count`
FROM `visitors`
WHERE `visit_date` >= '2024-07-27'
AND `visit_date` <= '2024-08-27'
---
    public function getVisitsForDateRange($startDate, $endDate)
    {
        return $this->where('visit_date >=', $startDate)
                    ->where('visit_date <=', $endDate)
                    ->selectSum('visit_count')
                    ->get()
                    ->getRow()
                    ->visit_count ?? 0;