app/Models/WisataModel.php

SELECT COUNT(*) AS `numrows` FROM `wisata`
---
    public function getTotalWisata()
    {
        return $this->countAll();

SELECT `nama_wisata`, `visit_count`
FROM `wisata`
ORDER BY `visit_count` DESC
 LIMIT 5
---
    public function getMostVisitedWisata($limit = 5)
    {
        return $this->select('nama_wisata, visit_count')
                    ->orderBy('visit_count', 'DESC')
                    ->limit($limit)
                    ->findAll();